ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_syspm.h
/***************************************************************************//**
* \file cy_syspm.h
* \version 4.20
*
* Provides the function definitions for the power management API.
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*******************************************************************************/

/**
* \addtogroup group_syspm
* \{
*
* Use the System Power Management (SysPm) driver to change power modes and 
* reduce system power consumption in power sensitive designs. 
*
* The functions and other declarations used in this driver are in cy_syspm.h. 
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions 
* and declarations in the PDL. 
*
* For multi-CPU devices, this library allows you to individually enter low power  
* modes for each CPU.
*
* This document contains the following topics:
*
* * \ref group_syspm_power_modes
* * \ref group_syspm_system_power_modes
*   - \ref group_syspm_switching_into_ulp
*     - \ref group_syspm_ulp_limitations
*   - \ref group_syspm_switching_into_lp
*     - \ref group_syspm_lp_limitations
*   - \ref group_syspm_switching_into_sleep
*   - \ref group_syspm_switching_into_deepsleep
*   - \ref group_syspm_wakingup_from_sleep_deepsleep
*   - \ref group_syspm_switching_into_hibernate
*   - \ref group_syspm_wakingup_from_hibernate
* * \ref group_syspm_system_reg_curr_mode
*   - \ref group_syspm_system_set_min_reg_curr_mode
*   - \ref group_syspm_system_set_normal_reg_curr_mode
* * \ref group_syspm_migration_guide_for_syspm_4_0
* * \ref group_syspm_managing_pmic
* * \ref group_syspm_managing_backup_domain
* * \ref group_syspm_cb
*   - \ref group_syspm_cb_example
*   - \ref group_syspm_cb_config_consideration
*     - \ref group_syspm_cb_parameters
*     - \ref group_syspm_cb_structures
*     - \ref group_syspm_cb_function_implementation
*     - \ref group_syspm_cb_flow
*     - \ref group_syspm_cb_registering
*     - \ref group_syspm_cb_unregistering
* * \ref group_syspm_definitions
*
* \section group_syspm_section_configuration Configuration Considerations
* \subsection group_syspm_power_modes Power Modes
* PSoC 6 MCUs support four system and three CPU power modes. These power modes
* are intended to minimize average power consumption in an application.
* System power modes:
* * <b>Low Power</b> - All peripheral and CPU power modes
*   are available to be used at maximum device frequency and current 
*   consumption.
* * <b>Ultra Low Power</b> - All peripheral and 
*   CPU power modes are available, but the frequency and current consumption 
*   are limited to a device specific number.
* * <b>Deep Sleep</b> - Device and I/O states is retained. Low-frequency 
*   peripherals are available. Both CPUs are in CPU Deep Sleep power mode. 
* * <b>Hibernate</b> - The device and I/O states are frozen and the device 
*   resets on wakeup.
*
* The CPU <b>Active</b>, <b>Sleep</b> and <b>Deep Sleep</b> power modes are 
* Arm-defined power modes supported by the Arm CPU instruction 
* set architecture (ISA). 
* 
* \subsection group_syspm_system_power_modes System Power Modes
* * <b>LP</b> - In this mode, code is executed and all logic and 
*   memories are powered. Firmware may disable/reduce clocks for specific 
*   peripherals and power down specific analog power domains.
*
* * <b>ULP</b> - This power mode is like LP mode, but 
*   with clock restrictions and limited/slower peripherals to achieve lower
*   current consumption. Refer to \ref group_syspm_switching_into_ulp in 
*   Configuration considerations.
*
* * <b>Deep Sleep</b> - Is a lower power mode where high-frequency clocks are 
*   disabled. Refer to \ref group_syspm_switching_into_deepsleep in 
*   Configuration considerations. Deep-sleep-capable peripherals are available. 
*   A normal wakeup from Deep Sleep returns to either system LP or ULP mode, 
*   depending on the previous state and programmed behavior for the configured 
*   wakeup interrupt. Likewise, a debug wakes up from system Deep Sleep and 
*   woken CPU returns to CPU Sleep. Refer 
*   to \ref group_syspm_wakingup_from_sleep_deepsleep in Configuration 
*   considerations.
*
* * <b>Hibernate</b> - Is the lowest power mode that is entered from 
*   firmware. Refer to \ref group_syspm_switching_into_hibernate in 
*   Configuration considerations. On wakeup the CPU(s) and all peripherals 
*   go through a full reset. The I/O's state is frozen so that the 
*   output driver state is held in system Hibernate. Note that in this mode, 
*   the CPU(s) and all peripherals lose their states, so the system and firmware
*   reboot on a wakeup event. Backup memory (if present) can be used to store 
*   limited system state for use on the next reboot. Refer to 
*   \ref group_syspm_wakingup_from_hibernate in Configuration considerations.
*
* \subsubsection group_syspm_switching_into_lp Switching the System into Low Power
* To set system LP mode you need to set LP voltage for the active core 
* regulator:
* * If active core regulator is the LDO, call:
*   \code{.c}
*   Cy_SysPm_LdoSetVoltage(CY_SYSPM_LDO_VOLTAGE_LP);
*   \endcode
* * If active core regulator is the Buck, call:
*   \code{.c}
*   Cy_SysPm_BuckSetVoltage1(CY_SYSPM_BUCK_OUT1_VOLTAGE_LP)
*   \endcode
*
* After switching into system LP mode, the operating frequency and current 
* consumption may now be increased up to \ref group_syspm_lp_limitations.
* The wait states for flash may be changed to increase device performance by 
* calling SysLib function Cy_SysLib_SetWaitStates(true, hfClkFreqMz), where 
* hfClkFreqMz is the frequency of HfClk0 in MHz.
*
* \subsubsection group_syspm_lp_limitations LP Limitations
* When the system is in LP mode, the core regulator voltage is set to
* <b>1.1 V (nominal)</b> and the following limitations must be met:
*
*   - The maximum operating frequency for all Clk_HF paths must not exceed 
*     <b>150 MHz*</b>, and peripheral and slow clock must 
*     not exceed <b>100 MHz *</b>
*
*   - The total current consumption must be less than or equal to 
*     <b>250 mA *</b>
*
* \warning * - Numbers shown are approximate and real limit values may be
* different because they are device specific. You should refer to the device 
* datasheet for exact values of maximum frequency and current in system LP mode.
*
* \subsubsection group_syspm_switching_into_ulp Switching the System into Ultra Low Power
* Before switching into system ULP mode, ensure that the device meets 
* \ref group_syspm_ulp_limitations. Decrease the clock frequencies, 
* and slow or disable peripherals. Also ensure that appropriate wait state 
* values are set for the flash. Flash wait states can be set by calling 
* SysLib function Cy_SysLib_SetWaitStates(true, hfClkFreqMz), where hfClkFreqMz 
* is the frequency of HfClk0 in MHz.
*
* After the \ref group_syspm_ulp_limitations are met and appropriate wait 
* states are set, you must set ULP voltage for the active core regulator:
* * If active core regulator is the LDO Core Voltage Regulator, call 
* Cy_SysPm_LdoSetVoltage(CY_SYSPM_LDO_VOLTAGE_ULP)
* * If active core regulator is the Buck Core Voltage Regulator, then call 
* Cy_SysPm_BuckSetVoltage1(CY_SYSPM_BUCK_OUT1_VOLTAGE_ULP)
*
* \subsubsection group_syspm_ulp_limitations ULP Limitations
* When the system is in ULP mode the core regulator voltage is set to <b>0.9 V 
* (nominal)</b> and the following limitations must be meet:
*
*   - The maximum operating frequency for all Clk_HF paths must not exceed 
*     <b>50 MHz *</b>, whereas the peripheral and slow clock must not exceed 
*     <b>25 MHz *</b>. 
*
*   - The total current consumption must be less than or equal 
*     to <b>20 mA*</b>
*
*   - the flash write operations are prohibited. The flash works in the 
*     Read-only operation. If Write operations are required, you must switch to
*     the system LP mode.
*
* \warning * - Numbers shown are approximate and real limit values may be
* different because they are device specific. You should refer to the device 
* datasheet for exact values of maximum frequency and current in system
* ULP mode.
*
* \subsubsection group_syspm_switching_into_sleep Switching CPU into Sleep
* For multi-CPU devices, the Cy_SysPm_CpuEnterSleep() switches only the CPU 
* that calls the function into the CPU Sleep power mode. 
*
* All pending interrupts must be cleared before the CPU is put into a 
* Sleep mode, even if they are masked.
*
* The CPU event register can be set in the past, for example, as a result of 
* internal system calls. So an old event can cause the CPU to not enter 
* Sleep mode upon WFE(). Therefore usually the WFE() is used in an idle loop or 
* polling loop as it might or might not cause entering of CPU Sleep mode. If 
* the idle loop or polling loop is not used, then it is recommended to use 
* WFI() instruction.
*
* \subsubsection group_syspm_switching_into_deepsleep Switching the System or CPU into Deep Sleep
* For multi-CPU devices, the Cy_SysPm_CpuEnterDeepSleep() function switches 
* only the CPU that calls the function into the CPU Deep Sleep power mode. 
* To set the whole system into Deep Sleep power mode, ensure that all CPUs call 
* the Cy_SysPm_CpuEnterDeepSleep() function.
*
* There are situations when the system does not switch into the Deep Sleep 
* power mode immediately after the last CPU calls Cy_SysPm_CpuEnterDeepSleep(). 
* The system will switch into Deep Sleep mode automatically a short time later, 
* after the low power circuits are ready to switch into Deep Sleep. Refer to 
* the Cy_SysPm_CpuEnterDeepSleep() description for more detail.
*
* All pending interrupts must be cleared before the system is put into a 
* Deep Sleep mode, even if they are masked.
*
* The CPU event register can be set in the past, for example, as a result of 
* internal system calls. So an old event can cause the CPU to not enter Deep 
* Sleep mode upon WFE(). Therefore usually the WFE() is used in an idle loop or 
* polling loop as it might or might not cause entering of CPU Deep Sleep mode. 
* If the idle loop or polling loop is not used, then it is recommended to use 
* WFI() instruction. 
*
* For single-CPU devices, SysPm functions that return the status of the 
* unsupported CPU always return CY_SYSPM_STATUS_<CPU>_DEEPSLEEP.
*
* \subsubsection group_syspm_wakingup_from_sleep_deepsleep Waking Up from Sleep or Deep Sleep
* For Arm-based devices, an interrupt is required for the CPU to wake up. 
* For multi-CPU devices, one CPU can wake up the other CPU by sending the 
* event instruction. Use the Cy_SysPm_CpuSendWakeupEvent() function.
*
* \subsubsection group_syspm_switching_into_hibernate Switching System to Hibernate
* If you call Cy_SysPm_SystemEnterHibernate() from either CPU, the system will
* be switched into the Hibernate power mode directly, because there is no 
* handshake between CPUs.
*
* \subsubsection group_syspm_wakingup_from_hibernate Waking Up from Hibernate
*
* The system can wake up from Hibernate mode by configuring the following wakeup
* sources:
* - Wakeup pin
* - LP Comparator
* - RTC alarm
* - WDT interrupt
*
* Wakeup is supported from device specific pin(s) with programmable polarity. 
* Additionally, unregulated peripherals can wake the system under some 
* conditions. For example, a low power comparator can wake the system by 
* comparing two external voltages, but does not support comparison to an 
* internally-generated voltage. The backup power domain remains functional, and 
* if present it can schedule an alarm to wake the system from Hibernate using 
* the RTC. Alternatively, the Watchdog Timer (WDT) can be configured to wake-up 
* the system by WDT interrupt. Refer to \ref Cy_SysPm_SetHibernateWakeupSource()
* for more detail.
*
* \subsection group_syspm_system_reg_curr_mode System Regulator Current Mode
* In addition to system ULP and LP modes, the five different resource 
* power settings can be configured to reduce current consumption:
* -# <b>Linear regulator low power mode</b>. Can be used only if core current
*    is below the LDO regulator LP threshold.
* -# <b>POR/BOD circuit low power mode</b>. Requires compatible power supply 
*    stability due to stability increase response time.
* -# <b>Bandgap reference circuits low power mode</b> (turns on Deep Sleep 
*    Bandgap). Requires design to accept reduced Vref accuracy. Active ref can 
*    be turned off after this feature is enabled.
* -# <b>Reference buffer circuit low power mode</b>. Requires design to accept 
*    reduced Vref accuracy.
* -# <b>Current reference circuit low power mode</b>. Require design to accept 
*    reduced Iref accuracy.
*
* These five sub features can modify both system LP or ULP modes as they are 
* independent from LP/ULP settings. 
* When all five sub features are set to their low power modes, the system 
* operates in regulator minimum current mode. In regulator minimum current mode,
* the system current consumption is limited to a device-specific value. Refer to 
* the device datasheet for the exact current consumption value in regulator 
* minimum current mode.
* 
* When all five sub features are set to their normal mode, the system operates
* in regulator normal current mode. When regulator normal current mode is set, 
* the system may operate at device maximum current.
* 
* \subsection group_syspm_system_set_min_reg_curr_mode Setting Minimum System Regulator Current Mode
*
* Before setting the regulator minimum current mode ensure that current limits 
* are be met. After current limits are met, call the 
* Cy_SysPm_SystemSetMinRegulatorCurrent() function.
* 
* \subsection group_syspm_system_set_normal_reg_curr_mode Setting Normal System Regulator Current Mode
*
* To set regulator normal current mode, call the 
* Cy_SysPm_SystemSetNormalRegulatorCurrent() function. After the function call, 
* the current limits can be increased to a maximum current, depending on what 
* system power mode is set: LP or ULP.
*
* \subsection group_syspm_managing_pmic Managing PMIC
*
* The SysPm driver also provides an API to configure the internal power 
* management integrated circuit (PMIC) controller for an external PMIC that 
* supplies Vddd. Use the API to enable the internal PMIC controller output that
* is routed to pmic_wakeup_out pin, and configure the polarity of the PMIC 
* controller input (pmic_wakeup_in) that is used to wake up the PMIC.
*
* The PMIC controller is automatically enabled when:
* * The PMIC is locked by a call to Cy_SysPm_PmicLock()
* * The configured polarity of the PMIC input and the polarity driven to 
*   pmic_wakeup_in pin matches.
*
* Because a call to Cy_SysPm_PmicLock() automatically enables the PMIC
* controller, the PMIC can remain disabled only when it is unlocked. See Cy_SysPm_PmicUnlock() 
* for more detail.
*
* Use Cy_SysPm_PmicIsLocked() to read the current PMIC lock status.
* 
* To enable the PMIC, use these functions in this order:
* \code{.c}
* Cy_SysPm_PmicUnlock();
* Cy_SysPm_PmicEnable();
* Cy_SysPm_PmicLock();
* \endcode
*
* To disable the PMIC controller, unlock the PMIC. Then call 
* Cy_SysPm_PmicDisable() with the inverted value of the current active state of 
* the pmic_wakeup_in pin.
* For example, assume the current state of the pmic_wakeup_in pin is active low.
* To disable the PMIC controller, call these functions in this order:
* \code{.c}
* Cy_SysPm_PmicUnlock();
* Cy_SysPm_PmicDisable(CY_SYSPM_PMIC_POLARITY_HIGH);
* \endcode
* Note that you do not call Cy_SysPm_PmicLock(), because that automatically 
* enables the PMIC.
* 
* While disabled, the PMIC controller is automatically enabled when the 
* pmic_wakeup_in pin state is changed into a high state.
*
* To disable the PMIC controller output, call these functions in this order:
* Cy_SysPm_PmicUnlock();
* Cy_SysPm_PmicDisableOutput();
*
* Do not call Cy_SysPm_PmicLock() (which automatically enables the PMIC 
* controller output).
* 
* When disabled, the PMIC controller output is enabled when the PMIC is locked, 
* or by calling Cy_SysPm_PmicEnableOutput().
*
* \subsection group_syspm_managing_backup_domain Managing the Backup Domain
* The SysPm driver provide functions to:
*
* * Configure Supercapacitor charging
* * Select power supply source (Vbackup or Vddd) for Vddbackup
* * Measure Vddbackup using the ADC
* 
* Refer to the \ref group_syspm_functions_backup functions for more detail.
*
* \subsection group_syspm_cb SysPm Callbacks
* The SysPm driver handles low power callbacks declared in the application. 
*
* If there are no callbacks registered, the device executes the power mode 
* transition. However, frequently your application firmware must make 
* modifications for low power mode. For example, you may need to disable a 
* peripheral, or ensure that a message is not being transmitted or received.
*
* To enable this, the SysPm driver implements a callback mechanism. When a lower
* power mode transition is about to take place (either entering or exiting 
* \ref group_syspm_system_power_modes), the registered callbacks for that 
* transition are called.
*
* The SysPm driver organizes all the callbacks into a linked list. While 
* entering a low power mode, SysPm goes through that linked list from first to 
* last, executing the callbacks one after another. While exiting low power mode,
* SysPm goes through that linked list again, but in the opposite direction from 
* last to first. This ordering supports prioritization of callbacks relative to 
* the transition event. 
*
* For example, the picture below shows three callback structures organized into 
* a linked list: myDeepSleep1, myDeepSleep2, myDeepSleep3 (represented with the 
* \ref cy_stc_syspm_callback_t configuration structure). Each structure 
* contains, among other fields, the address of the callback function. The code 
* snippets below set this up so that myDeepSleep1 is called first when entering 
* the low power mode. This also means that myDeepSleep1 will be the last one to 
* execute when exiting the low power mode.
*
* The callback structures after registration:
* \image html syspm_register_eq.png
*
* Your application must register each callback, so that SysPm can execute it. 
* Upon registration, the linked list is built by the SysPm driver. Notice 
* the &myDeepSleep1 address in the myDeepSleep1 
* \ref cy_stc_syspm_callback_t structure. This is filled in by the SysPm driver,
* when you register myDeepSleep1. The cy_stc_syspm_callback_t.order element 
* defines the order of their execution by the SysPm driver.
* Call \ref Cy_SysPm_RegisterCallback() to register each callback function. 
* 
* A callback function is typically associated with a particular driver that 
* handles the peripheral. So the callback mechanism enables a peripheral to 
* prepare for a low power mode (for instance, shutting down the analog part); 
* or to perform tasks while exiting a low power mode (like enabling the analog 
* part again).
*
* With the callback mechanism you can prevent switching into a low power mode if
* a peripheral is not ready. For example, driver X is in the process of 
* receiving a message. In the callback function implementation simply return 
* CY_SYSPM_FAIL in a response to CY_SYSPM_CHECK_READY.
*
* If success is returned while executing a callback, the SysPm driver calls the 
* next callback and so on to the end of the list. If at some point a callback 
* returns CY_SYSPM_FAIL in response to the CY_SYSPM_CHECK_READY step, all the 
* callbacks that have already executed are executed in reverse order, with the 
* CY_SYSPM_CHECK_FAIL mode parameter. This allows each callback to know that 
* entering the low power mode has failed. The callback can then undo whatever it
* did to prepare for low power mode, if required. For example, if the driver X 
* callback shut down the analog part, it can re-enable the analog part.
* 
* Let's switch to an example explaining the implementation, setup, and 
* registration of three callbacks (myDeepSleep1, myDeepSleep2, myDeepSleep2) in 
* the application. The \ref group_syspm_cb_config_consideration are provided 
* after the \ref group_syspm_cb_example.
* 
* \subsection group_syspm_cb_example SysPm Callbacks Example
*
* The following code snippets demonstrate how use the SysPm callbacks mechanism.
* We will build the prototype for an application that registers 
* three callback functions:
*    -# myDeepSleep1 - Handles CPU Deep Sleep.
*    -# myDeepSleep2 - Handles CPU Deep Sleep and is associated with peripheral 
*       HW1_address (see <a href="..\..\pdl_user_guide.pdf">PDL Design</a> 
*       section to learn about the base hardware address).
*    -# myDeepSleep3 - Handles entering and exiting system Deep Sleep and is 
*       associated with peripheral HW2_address.
*
* We set things up so that the myDeepSleep1 and myDeepSleep2 callbacks do 
* nothing while entering the low power mode (skip on 
* CY_SYSPM_SKIP_BEFORE_TRANSITION - 
* see \ref group_syspm_cb_function_implementation in 
* \ref group_syspm_cb_config_consideration).
* Skipping the actions while entering low power might be useful if you need 
* to save time while switching low power modes. This is because the callback
* function with a skipped mode is not even called avoiding the call and return
* overhead.
* 
* Let's first declare the callback functions. Each gets the pointer to the 
* \ref cy_stc_syspm_callback_params_t structure as the argument.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Callback_Func_Declaration
*
* Now we setup the \ref cy_stc_syspm_callback_params_t structures that we will
* pass to the callback functions. Note that for the myDeepSleep2 and 
* myDeepSleep3 callbacks we also pass pointers to the peripherals related to 
* that callback (see <a href="..\..\pdl_user_guide.pdf">PDL Design</a> section 
* to learn about base hardware addresses). 
* The configuration considerations related to this structure are described 
* in \ref group_syspm_cb_parameters in \ref group_syspm_cb_config_consideration.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Callback_Params_Declaration
*
* Now we setup the actual callback configuration structures. Each of these 
* contains, among the other fields, the address of the 
* \ref cy_stc_syspm_callback_params_t we just set up. We will use the callback 
* configuration structures later in the code to register the callbacks in the 
* SysPm driver. Again, we set things up so that the myDeepSleep1 and 
* myDeepSleep2 callbacks do nothing while entering the low power mode 
* (skip on CY_SYSPM_SKIP_BEFORE_TRANSITION) - see 
* \ref group_syspm_cb_function_implementation in 
* \ref group_syspm_cb_config_consideration.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Callback_Structure_Declaration
*
* Note that in each case the last two fields are NULL. These are fields used by 
* the SysPm driver to set up the linked list of callback functions.
* 
* The callback structures are now defined and allocated in the user's 
* memory space:
* \image html syspm_before_registration.png
*
* Now we implement the callback functions. See 
* \ref group_syspm_cb_function_implementation in 
* \ref group_syspm_cb_config_consideration for the instructions on how the 
* callback functions should be implemented.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_Callback_Func_Implementation
*
