ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_syspm.h
* Finally, we register the callbacks so that the SysPm driver knows about them. 
* The order in which the callbacks will be called depends upon the order in 
* which the callbacks are registered. If there are no callbacks registered, 
* the device just executes the power mode transition.
*
* Callbacks that reconfigure global resources, such as clock frequencies, should
* be registered last. They then modify global resources as the final step before
* entering the low power mode, and restore those resources first, as the system
* returns from low power mode.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_RegisterCallback
*
* We are done configuring three callbacks. Now the SysPm driver will execute the
* callbacks appropriately whenever there is a call to a power mode transition 
* function: \ref Cy_SysPm_CpuEnterSleep(), \ref Cy_SysPm_CpuEnterDeepSleep(), 
* \ref Cy_SysPm_SystemEnterUlp(), \ref Cy_SysPm_SystemEnterLp(), and 
* \ref Cy_SysPm_SystemEnterHibernate().
* \note On a wakeup from hibernate the device goes through a reset, so the 
* callbacks with CY_SYSPM_AFTER_TRANSITION are not executed. Refer to 
* \ref Cy_SysPm_SystemEnterHibernate() for more detail.
* 
* Refer to \ref group_syspm_cb_unregistering in 
* \ref group_syspm_cb_config_consideration to learn what to do if you need to 
* remove the callback from the linked list. You might want to unregister the 
* callback for debug purposes.
* 
* Refer to \ref group_syspm_cb_flow in \ref group_syspm_cb_config_consideration 
* to learn about how the SysPm processes the callbacks.
*
* \subsection group_syspm_cb_config_consideration Callback Configuration Considerations
*
* \subsubsection group_syspm_cb_parameters Callback Function Parameters
* 
* The <b>callbackParams</b> parameter of the callback function is a 
* \ref cy_stc_syspm_callback_params_t structure. The second parameter 
* (<b>mode</b>) is for internal use. In the example code we used a 
* dummy value CY_SYSPM_CHECK_READY to eliminate compilation errors associated 
* with the enumeration. The driver sets the <b>mode</b> field to the correct 
* value when calling the callback functions (the mode is referred to as step in 
* the \ref group_syspm_cb_function_implementation). The callback function reads 
* the value and executes code based on the mode set by the SysPm driver. 
* The <b>base</b> and <b>context</b> fields are optional and can be NULL. 
* Some drivers require a base hardware address and context to store information 
* about the mode transition. If your callback routine requires access to the 
* driver registers or context, provide those values 
* (see <a href="..\..\pdl_user_guide.pdf">PDL Design</a> section 
* to learn about Base Hardware Address). Be aware of MISRA warnings if these 
* parameters are NULL.
*
* \subsubsection group_syspm_cb_structures Callback Function Structure
* For each callback, provide a \ref cy_stc_syspm_callback_t structure. Some 
* fields in this structure are maintained by the driver. Use NULL for 
* cy_stc_syspm_callback_t.prevItm and cy_stc_syspm_callback_t.nextItm. 
* Driver uses these fields to build a linked list of callback functions.
* The value of cy_stc_syspm_callback_t.order element is used to define the order
* how the callbacks are put into linked list, and sequentially, how the 
* callbacks are executed. See \ref group_syspm_cb_registering section.
*
* \warning The Cy_SysPm_RegisterCallback() function stores a pointer to the 
* cy_stc_syspm_callback_t structure. Do not modify elements of the 
* cy_stc_syspm_callback_t structure after the callback is registered. 
* You are responsible for ensuring that the structure remains in scope. 
* Typically the structure is declared as a global or static variable, or as a 
* local variable in the main() function.
*
* \subsubsection group_syspm_cb_function_implementation Callback Function Implementation
*
* Every callback function should handle four possible steps (referred to as 
* "mode") defined in \ref cy_en_syspm_callback_mode_t :
*    * CY_SYSPM_CHECK_READY - Check if ready to enter a power mode.
*    * CY_SYSPM_BEFORE_TRANSITION - The actions to be done before entering 
*      the low power mode.
*    * CY_SYSPM_AFTER_TRANSITION - The actions to be done after exiting the 
*      low power mode.
*    * CY_SYSPM_CHECK_FAIL - Roll back any actions performed in the callback 
*      executed previously with CY_SYSPM_CHECK_READY.
*
* A callback function can skip steps (see \ref group_syspm_skip_callback_modes).
* In our example myDeepSleep1 and myDeepSleep2 callbacks do nothing while 
* entering the low power mode (skip on CY_SYSPM_BEFORE_TRANSITION). If there is
* anything preventing low power mode entry - return CY_SYSPM_FAIL in response to
* CY_SYSPM_CHECK_READY in your callback implementation. Note that the callback 
* should return CY_SYSPM_FAIL only in response to CY_SYSPM_CHECK_READY. The 
* callback function should always return CY_SYSPM_PASS for other modes: 
* CY_SYSPM_CHECK_FAIL, CY_SYSPM_BEFORE_TRANSITION, and CY_SYSPM_AFTER_TRANSITION
* (see \ref group_syspm_cb_flow).
* 
* \subsubsection group_syspm_cb_flow Callbacks Execution Flow
*
* This section explains what happens during a power transition, when callbacks 
* are implemented and set up correctly. The following discussion assumes:
* * All required callback functions are defined and implemented
* * All cy_stc_syspm_callback_t structures are filled with required values
* * All callbacks are successfully registered 
*
* User calls one of the power mode transition functions: \ref Cy_SysPm_CpuEnterSleep(), 
* \ref Cy_SysPm_CpuEnterDeepSleep(), \ref Cy_SysPm_SystemEnterUlp(), 
* \ref Cy_SysPm_SystemEnterLp(), or \ref Cy_SysPm_SystemEnterHibernate(). 
* It calls each callback with the mode set to CY_SYSPM_CHECK_READY. This 
* triggers execution of the code for that mode inside of each user callback.
* 
* The intent of CY_SYSPM_CHECK_READY is to only signal if the resources is ready
* to transition. Ideally, no transition changes should be made at this time. 
* In some cases a small change may be required. For example a communication 
* resource callback may set a flag telling firmware not to start any new 
* transition.

* If that process is successful for all callbacks, then 
* \ref Cy_SysPm_ExecuteCallback() calls each callback with the mode set to 
* CY_SYSPM_BEFORE_TRANSITION. This triggers execution of the code for that mode 
* inside each user callback. We then enter the low power mode after all callback
* are executed.
* 
* When exiting the low power mode, the SysPm driver executes 
* \ref Cy_SysPm_ExecuteCallback() again. This time it calls each callback in 
* reverse order, with the mode set to CY_SYSPM_AFTER_TRANSITION. This triggers 
* execution of the code for that mode inside each user callback. The final 
* execution of callbacks depends on the low power mode in which callbacks were 
* called:
* * For CPU Sleep or Deep Sleep power modes, the CY_SYSPM_AFTER_TRANSITION mode 
*   is called after the CPU wakes from Sleep or Deep Sleep.
* * For system Hibernate, the CY_SYSPM_AFTER_TRANSITION mode is not executed 
*   because the device reboots after the wakeup from the Hibernate.
* * For system LP and ULP modes, after the CY_SYSPM_AFTER_TRANSITION mode was 
*   called the system remains in the new power mode: LP or ULP.
* 
* A callback can return CY_SYSPM_FAIL only while executing the 
* CY_SYSPM_CHECK_READY mode. If that happens, then the remaining callbacks are 
* not executed. Any callbacks that have already executed are called again, in 
* reverse order, with CY_SYSPM_CHECK_FAIL. This allows the system to return to 
* the previous state. If a callback returns a fail then any of the functions 
* (\ref Cy_SysPm_CpuEnterSleep(), \ref Cy_SysPm_CpuEnterDeepSleep(), 
* \ref Cy_SysPm_SystemEnterUlp(), \ref Cy_SysPm_SystemEnterLp(), or 
* \ref Cy_SysPm_SystemEnterHibernate()) that attempt to switch the device into 
* a low power mode will also return CY_SYSPM_FAIL.
*
* Callbacks that reconfigure global resources, such as clock frequencies, 
* should be registered last. They then modify global resources as the final 
* step before entering the low power mode, and restore those resources first, 
* as the system returns from low power mode.
*
* \subsubsection group_syspm_cb_registering Callback Registering
* While registration the callback is put into the linked list. The 
* place where the callback structure is put into the linked list is based on 
* cy_stc_syspm_callback_t.order. The callback with the lowest 
* cy_stc_syspm_callback_t.order value will be placed at the beginning of linked 
* list. The callback with the highest cy_stc_syspm_callback_t.order value will 
* be placed at the end of the linked list.
* If there is already a callback structure in the linked list with the same
* cy_stc_syspm_callback_t.order value as you attend to register, then your 
* callback will be placed right after such a callback.
*
* Such a registration order defines how the callbacks are executed: 
* * Callbacks with the lower cy_stc_syspm_callback_t.order are executed first 
* when entering into low power and last when exiting from low power.
* * Callbacks with the higher cy_stc_syspm_callback_t.order are executed last 
* when entering into low power and first when exiting from low power.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_RegisterCallback
*
* Callbacks with equal cy_stc_syspm_callback_t.order values are
* registered in the same order as they are registered:
* \image html syspm_register_eq.png

* Callbacks with a different cy_stc_syspm_callback_t.order value will be 
* stored based on the cy_stc_syspm_callback_t.order value, with no matter when 
* they when registered:
*
* \image html syspm_register_dif.png
*
* This can be useful to ensure that system resources (clock dividers, etc) are 
* changed right before entering low power mode and immediately after exiting 
* from low power.
*
* \subsubsection group_syspm_cb_unregistering Callback Unregistering
*
* Unregistering the callback might be useful when you need to dynamically manage
* the callbacks.
*
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_UnregisterCallback
* The callback structures after myDeepSleep2 callback is unregistered:
* \image html syspm_unregistration.png
*
* \section group_syspm_definitions Definitions
*
* <table class="doxtable">
*   <tr>
*     <th>Term</th>
*     <th>Definition</th>
*   </tr>
*
*   <tr>
*     <td>LDO</td>
*     <td>Low dropout linear regulator. The functions that manage this 
*         block are grouped as \ref group_syspm_functions_ldo under 
*         \ref group_syspm_functions_core_regulators</td>
*   </tr>
*
*   <tr>
*     <td>SIMO Buck</td>
*     <td>Single inductor multiple Output Buck regulator, referred as 
*         "Buck regulator" throughout the documentation. The functions that 
*         manage this block are grouped as \ref group_syspm_functions_buck under
*         \ref group_syspm_functions_core_regulators</td>
*   </tr>
*
*   <tr>
*     <td>SISO Buck</td>
*     <td>Single inductor single output Buck regulator, referred as 
*         "Buck regulator" throughout the documentation. The functions that 
*         manage this block are grouped as \ref group_syspm_functions_buck under
*         \ref group_syspm_functions_core_regulators</td>
*   </tr>

